export const ageClass = {
  "総数": "00",
  "15～24歳": "01",
  "25～34歳": "03",
  "35～44歳": "04",
  "45～54歳": "05",
  "55～64歳": "06",
  "65歳以上": "07",
  "15～19歳": "08",
  "20～24歳": "09",
  "25～29歳": "10",
  "30～34歳": "11",
  "35～39歳": "12",
  "40～44歳": "13",
  "45～49歳": "14",
  "50～54歳": "15",
  "55～59歳": "16",
  "60～64歳": "17",
  "65～69歳": "18",
  "70～74歳": "19",
  "75歳以上": "20",
};

export const employmentType = {
  "雇用者": "00",
  "役員を除く雇用者": "02",
  "正規の職員・従業員": "03",
  "非正規の職員・従業員": "10",
  "パート・アルバイト": "04",
  "パート": "05",
  "アルバイト": "06",
  "労働者派遣事業所の派遣社員": "07",
  "契約社員・嘱託": "08",
  "契約社員": "11",
  "嘱託": "12",
  "その他": "09",
};

export const education = {
  "総数": "00",
  "在学中計": "01",
  "小学・中学・高校（在学中）": "02",
  "短大・高専（在学中）": "03",
  "大学・大学院（在学中）": "04",
  "卒業計": "05",
  "小学・中学・高校・旧中（卒業）": "06",
  "短大・高専（卒業）": "07",
  "大学・大学院（卒業）": "08",
  "大学（卒業）": "09",
  "大学院（卒業）": "10",
};

export const sex = { 総数: "00", 男: "01", 女: "02" };

export const allNullData = {
  "2002年": null,
  "2003年": null,
  "2004年": null,
  "2005年": null,
  "2006年": null,
  "2007年": null,
  "2008年": null,
  "2009年": null,
  "2010年": null,
  "2011年": null,
  "2012年": null,
  "2013年": null,
  "2014年": null,
  "2015年": null,
  "2016年": null,
  "2017年": null,
  "2018年": null,
  "2019年": null,
  "2020年": null,
  "2021年": null,
};

export const years = Object.keys(allNullData);
